{"keras_version": "2.0.8", "config": [{"class_name": "Masking", "config": {"batch_input_shape": [null, 3, 22], "dtype": "float32", "trainable": true, "mask_value": -1, "name": "masking_1"}}, {"class_name": "LSTM", "config": {"go_backwards": false, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "return_sequences": false, "activation": "tanh", "stateful": false, "trainable": true, "implementation": 0, "recurrent_constraint": null, "batch_input_shape": [null, 3, 22], "bias_constraint": null, "unroll": false, "dtype": "float32", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_state": false, "activity_regularizer": null, "kernel_constraint": null, "dropout": 0.0, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "name": "lstm_1", "bias_regularizer": null, "units": 300, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "trainable": true, "batch_input_shape": [null, 300], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "bias_regularizer": null, "dtype": "float32", "units": 11, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "name": "activation_1"}}], "class_name": "Sequential", "backend": "tensorflow"}