{"class_name": "Sequential", "config": [{"class_name": "Masking", "config": {"batch_input_shape": [null, 3, 21], "trainable": true, "mask_value": -1, "dtype": "float32", "name": "masking_1"}}, {"class_name": "LSTM", "config": {"trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "lstm_1", "units": 300, "return_sequences": false, "activity_regularizer": null, "return_state": false, "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "go_backwards": false, "recurrent_regularizer": null, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "batch_input_shape": [null, 3, 21], "activation": "tanh", "recurrent_dropout": 0.0, "dtype": "float32", "stateful": false, "dropout": 0.0, "implementation": 0, "unit_forget_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "use_bias": true}}, {"class_name": "Dense", "config": {"batch_input_shape": [null, 300], "activation": "linear", "trainable": true, "name": "dense_1", "units": 11, "dtype": "float32", "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_1"}}], "keras_version": "2.0.8", "backend": "tensorflow"}