{"backend": "tensorflow", "keras_version": "2.0.8", "config": [{"config": {"batch_input_shape": [null, 1, 18], "dtype": "float32", "trainable": true, "mask_value": -1, "name": "masking_1"}, "class_name": "Masking"}, {"config": {"batch_input_shape": [null, 1, 18], "dtype": "float32", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 32, "implementation": 0, "bias_regularizer": null, "unit_forget_bias": true, "activation": "tanh", "dropout": 0.0, "recurrent_constraint": null, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "stateful": false, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "kernel_regularizer": null, "return_state": false, "return_sequences": false, "recurrent_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "unroll": false, "use_bias": true, "recurrent_dropout": 0.0, "name": "lstm_1"}, "class_name": "LSTM"}, {"config": {"batch_input_shape": [null, 32], "dtype": "float32", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 9, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "trainable": true, "use_bias": true, "name": "dense_1", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"activation": "softmax", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}], "class_name": "Sequential"}