{"config": [{"config": {"trainable": true, "name": "masking_1", "batch_input_shape": [null, 1, 18], "mask_value": -1, "dtype": "float32"}, "class_name": "Masking"}, {"config": {"recurrent_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "name": "lstm_1", "unroll": false, "return_sequences": false, "dropout": 0.0, "implementation": 0, "recurrent_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "bias_regularizer": null, "batch_input_shape": [null, 1, 18], "units": 32, "recurrent_dropout": 0.0, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "return_state": false, "go_backwards": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dtype": "float32", "unit_forget_bias": true, "use_bias": true, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "activation": "tanh", "stateful": false}, "class_name": "LSTM"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "name": "dense_1", "units": 9, "batch_input_shape": [null, 32], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "trainable": true, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "2.0.8", "backend": "tensorflow"}