{"class_name": "Sequential", "keras_version": "2.0.8", "config": [{"class_name": "Masking", "config": {"dtype": "float32", "mask_value": -1, "trainable": true, "batch_input_shape": [null, 1, 18], "name": "masking_1"}}, {"class_name": "LSTM", "config": {"units": 32, "bias_constraint": null, "dtype": "float32", "bias_regularizer": null, "stateful": false, "activation": "tanh", "use_bias": true, "trainable": true, "activity_regularizer": null, "unroll": false, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "batch_input_shape": [null, 1, 18], "recurrent_dropout": 0.0, "implementation": 0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "return_sequences": false, "recurrent_constraint": null, "go_backwards": false, "kernel_regularizer": null, "recurrent_regularizer": null, "unit_forget_bias": true, "return_state": false, "name": "lstm_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"units": 9, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "use_bias": true, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "batch_input_shape": [null, 32]}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_1"}}], "backend": "tensorflow"}