{"keras_version": "2.0.8", "config": [{"config": {"mask_value": -1, "trainable": true, "name": "masking_1", "batch_input_shape": [null, 1, 18], "dtype": "float32"}, "class_name": "Masking"}, {"config": {"bias_regularizer": null, "activation": "tanh", "unroll": false, "units": 32, "stateful": false, "batch_input_shape": [null, 1, 18], "kernel_constraint": null, "recurrent_constraint": null, "go_backwards": false, "trainable": true, "return_state": false, "recurrent_dropout": 0.0, "unit_forget_bias": true, "implementation": 0, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "dtype": "float32", "name": "lstm_1", "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "dropout": 0.0, "recurrent_regularizer": null, "return_sequences": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "LSTM"}, {"config": {"trainable": true, "activation": "linear", "bias_constraint": null, "units": 9, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 32], "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "dtype": "float32", "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "softmax"}, "class_name": "Activation"}], "backend": "tensorflow", "class_name": "Sequential"}